// Задача 64: Задайте значения M и N. Напишите программу,
//  которая выведет все натуральные числа в промежутке от M до N.

// M = 1; N = 5. -> ""1, 2, 3, 4, 5""

// M = 4; N = 8. -> ""4, 5, 6, 7, 8""

string Sum(int n, int m)
{
    if (n == m) return $"{m} ";
    return Sum(n - 1, m) + n + " ";
}
Console.WriteLine(Sum(8, 4));